# PhyMaterialParamTensionParallel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamTensionParallel Property
ParameterTypeId Class See Also
---
"Tension Parallel to Grain"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamTensionParallel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamTensionParallel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamTensionParallel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace